backend/app/controllers/api/v1/cake_ingredients_controller.rb

SELECT "cake_ingredients".* FROM "cake_ingredients"
---
      def index

        render json: CakeIngredient.all.to_json(only: [:id, :cake_id, :ingredient_id])