backend/app/controllers/api/v1/cakes_controller.rb

SELECT "cakes".* FROM "cakes"
---
      def index
        # render json: Cake.includes(:ingredients), include: ['ingredients']
        # render json: Cake.all
        # render json: Cake.all, serializer: CakeSerializer
        render json: Cake.all.to_json(only: [:name, :imgUrl],
                          include: [ingredients: { only: [:name, :part, :imgUrl]}])

INSERT INTO "cakes" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Cristian"], ["created_at", "2019-01-04 10:56:55.124777"], ["updated_at", "2019-01-04 10:56:55.124777"]]
---
      def create

        @cake = Cake.create(name: params['name'])