backend/app/controllers/api/v1/ingredients_controller.rb

      def index
        # render json: Ingredient.includes(:cakes), include:
        #   ['cakes']
        render json: Ingredient.all.to_json(only: [:id, :name, :part, :imgUrl, :price],
                            include: [cakes: { only: [:name]}])
---
SELECT "cake_ingredients".* FROM "cake_ingredients" WHERE "cake_ingredients"."ingredient_id" IN ($1, $2, $3, $4)  [["ingredient_id", 1], ["ingredient_id", 2], ["ingredient_id", 3], ["ingredient_id", 4]]
SELECT "ingredients".* FROM "ingredients"